import React, { useState } from "react";
import Slider from "react-slick";
import "slick-carousel/slick/slick.css";
import "slick-carousel/slick/slick-theme.css";
import "../images/3q.jpg";
import "../pages/pages_css.css";
import pro from "../images/7q.jpg";
import pro1 from "../images/6q.jpg";
import pro2 from "../images/5q.jpg";
// -------------------------------------
import Header from "../Components/Header";

import Fade from "react-reveal/Fade";


function SampleNextArrow(props) {
  const { className, style, onClick } = props;
  return (
    <div
      className={className}
      style={{
        ...style,
        display: "block",
        position: "relative",
        left: "98%",
        top: "-356px",
        background: "red",
        padding: "40px",
        borderRadius: "50%",
      }}
      onClick={onClick}
    />
  );
}

function SamplePrevArrow(props) {
  const { className, style, onClick } = props;
  return (
    <div
      className={className}
      style={{
        ...style,
        display: "block",
        position: "relative",
        left: "-50px",
        top: "360px",
        background: "green",
        padding: "40px",
        borderRadius: "50%",
      }}
      onClick={onClick}
    />
  );
}

const SliderWithImages_Four = () => {
  const [value, setValue] = useState(0);

  const settings = {
    dots: true,
    infinite: true,
    speed: 500,
    slidesToShow: 1,
    slidesToScroll: 1,
    nextArrow: <SampleNextArrow />,
    prevArrow: <SamplePrevArrow />,
    beforeChange: (current, next) => setValue(next),
  };

  return (
    <>
      <Fade top>
        <Header />
      </Fade>
      <Fade left>
        <p className="par_f"> ارتداء الكمامات</p>
        <div className="slider-container">
          <Slider {...settings}>
            <div>
              <p className="ppppp">
                لا يوجد أي إجراءات يمكن اتخاذها للحد من الوقاية، بل على العكس
                فالوقاية هي الوسيلة الأساسية للحد من انتشار الأمراض المعدية.
                وذلك من خلال اتباع الإجراءات الوقائية الموصى بها من قبل الجهات
                الصحية المختصة، والتي تشمل: <br /> 1. <br />
                ارتداء الكمامات الطبية أو القماشية عند الخروج من المنزل وفي
                الأماكن العامة. <br /> 2. <br />
                غسل اليدين بانتظام بالماء والصابون لمدة 20 ثانية على الأقل، أو
                استخدام معقم اليدين عند عدم وجود الماء والصابون
                <br /> 3. <br />
                الحفاظ على التباعد الاجتماعي بمسافة لا تقل عن مترين عن الآخرين
                <br /> 4. <br />
                تجنب الاحتكاك بالعينين والأنف والفم
                <br /> 5. <br />
                تجنب الاجتماعات الكبيرة والتجمعات الحاشدة
                <br /> 6. <br />
                التأكد من تهوية الأماكن المغلقة والتهوية الجيدة في الأماكن
                المشتركة
                <br /> 7.
                <br /> إجراء الفحوصات اللازمة والتطعيمات عند الحاجة. عدم
                الالتزام بالإجراءات الوقائية أو الحد منها يمكن أن يزيد من انتشار
                الأمراض المعدية وتفشيها بين الأفراد، مما يؤدي إلى زيادة في عدد
                الحالات والوفيات. لذلك، يجب على الجميع الالتزام بالإجراءات
                الوقائية للحد من انتشار الأمراض المعدية.
              </p>
            </div>
            <div>
              <p className="ppppp">
                هناك العديد من الأمراض المعدية التي يمكن الوقاية منها من خلال
                اتباع الإجراءات الوقائية المناسبة، ومن أهم هذه الأمراض:
                <br /> 1.
                <br />
                الإنفلونزا: يمكن الوقاية من الإنفلونزا بأخذ لقاح الإنفلونزا
                السنوي وتجنب التجمعات الكبيرة وغسل اليدين بانتظام.
                <br /> 2. <br />
                كوفيد-19: يمكن الوقاية من فيروس كورونا المستجد (كوفيد-19)
                بارتداء الكمامات وغسل اليدين والحفاظ على التباعد الاجتماعي
                وتنظيف الأسطح الملامسة بانتظام وإجراء الفحوصات اللازمة وتلقي
                اللقاح.
                <br /> 3. <br />
                السل: يمكن الوقاية من السل بأخذ اللقاح المضاد للسل وتجنب التعرض
                للأشخاص المصابين والحفاظ على نظافة البيئة
                <br />. 4. <br />
                الإيدز: يمكن الوقاية من الإيدز بتجنب ممارسة الجنس الغير آمن وعدم
                استخدام أدوات حادة مشتركة واستخدام الواقي الذكري.
                <br /> 5. <br />
                الالتهاب الرئوي: يمكن الوقاية من الالتهاب الرئوي بالتدخين وتجنب
                التعرض للجو البارد والتحسس والحفاظ على نظافة الجهاز التنفسي.
                وهناك العديد من الأمراض المعدية الأخرى التي يمكن الوقاية منها،
                وينبغي على الأفراد اتباع الإجراءات الوقائية المناسبة للوقاية من
                هذه الأمراض والحفاظ على صحتهم.
              </p>
            </div>
            <div>
              <p className="ppppp">
                لكل مرض معد علاماته وأعراضه الخاصة وتتضمن العلامات والأعراض
                <br /> :العامّة والمشتركة بين عددٍ من الأمراض المعدية ما يلي
                الحمى إسهال الإرهاق آلام في العضلات سعال <br />
                متى تزور الطبيب اطلب الرعاية الطبية إذا كنت: تعرضت للعَضِّ من
                حيوان تعاني من صعوبة في التنفس تسعل من أكثر من أسبوع تعاني من
                صداع حاد مع حمى تُعاني طفحًا جلديًّا أو تورمًا تعاني من حمى
                غامضة أو طويلة تعاني من مشاكل مفاجئة في الرؤية
                <img src={pro} alt="doctor" />
              </p>
            </div>
            <div>
              <p className="ppppp">
                <br />
                يُمكن أن تحدُث الأمراض المُعدية بسبب: البكتيريا. تلك الكائنات
                وحيدة الخلية مسئولة عن حدوث أمراض مثل التهاب الحلق العقدي، وعدوى
                الجهاز البولي، والسُلِّ. الفيروسات. تسبب الفيروسات، وهي كائنات
                أصغر من البكتيريا، العديد من الأمراض والتي تتراوح من نزلات البرد
                وحتى الإيدز. الفطريات. تحدُث العديد من الأمراض الجلدية مثل
                السعفة والقدَم الرياضي بسبب الفطريات. بينما يُمكن أن تُسبب أنواع
                أخرى من الفطريات عدوى في الرئتين أو الجهاز العصبي. الطفيليات.
                تحدث الإصابة بالملاريا نتيجة التعرض لطفيل صغير للغاية ينتقل عن
                طريق لدغة البعوض. بينما قد تنتقل بعض الطفيليات الأخرى إلى
                الإنسان عبر فضلات الحيوانات.
                <img src={pro2} alt="doctor" />
              </p>
            </div>
            <div>
              <p className="ppppp">
                <br />
                تلوث الطعام يمكن أن تصيبك أيضًا الجراثيم المسببة للأمراض من خلال
                <br />
                الطعام والماء الملوث. تسمح آلية الانتقال هذه انتشار الجراثيم
                للعديد من الأشخاص من خلال مصدر واحد. على سبيل المثال، فإن
                البكتيريا الإشريكية القولونية (E. coli) هي بكتيريا موجودة في
                أطعمة معينة - مثل الهامبرغر غير المطهو جيدًا أو عصير الفاكهة غير
                المبستر
                <img src={pro1} alt="doctor" />
              </p>
            </div>
            <div>
              <p className="ppppp">
                <br />
                عوامل الخطر بينما يمكن لأي شخص أن يحمل أمراضًا معدية، قد تكون
                أكثر عرضة للإصابة بالمرض إذا كان نظام المناعة لا يؤدي وظيفته
                بشكل سليم. وهذا قد يحدث في الحالات التالية: تتناول الستيرويدات
                أو أدوية أخرى تكبح جهاز المناعة، مثل الأدوية المضادة لرفض العضو
                المزروع كنت مُصابًا بفيروس نقص المناعة البشرية (HIV) أو الإيدز
                تعاني أنواعًا معينة من السرطان أو الاضطرابات الأخرى التي تؤثر
                على جهازك المناعي بالإضافة إلى ذلك، بعض الحالات المرضية الأخرى
                قد تعرضك للإصابة بالعدوى، بما فيها الأجهزة الطبية المزروعة وسوء
                التغذية ومختلف الأعمار من أصغرها إلى أكبرها وغير ذلك.
                <img src={pro} alt="doctor" />
              </p>
            </div>
          </Slider>
          <div className="slider-value">{value + 1}</div>
        </div>
      </Fade>
    </>
  );
};

export default SliderWithImages_Four;
